import Link from "next/link";

export const metadata = {
  title: "Политика конфиденциальности | MeduzaStore",
  description: "Политика конфиденциальности сайта mdzstore.ru",
};

export default function PrivacyPage() {
  return (
    <div className="min-h-screen bg-[#f2f2f2] py-12 md:py-20 px-4">
      <div className="w-full max-w-full sm:max-w-[640px] md:max-w-[768px] lg:max-w-[1024px] xl:max-w-[1280px] 2xl:max-w-[1520px]  mx-auto">
        <h1 className="text-3xl sm:text-4xl md:text-5xl lg:text-6xl xl:text-5xl font-semibold  text-[#181a1c] mb-8">
          Политика конфиденциальности
        </h1>

        <div className="prose prose-lg max-w-none text-[#404549] space-y-6">
          <section>
            <p>
              Настоящий документ «Политика конфиденциальности» (далее по тексту
              – «Политика») представляет собой правила использования /ИП
              Васениным Сергеем Станиславовичем/ (далее – «мы» и/или
              «Администрация») данных интернет-пользователей (далее «вы» и/или
              «Пользователь»), собираемых с использованием сайта
              /https://mdzstore.ru/   (далее – «Сайт»).
            </p>
          </section>
          <section>
            <h2 className="text-3xl sm:text-4xl md:text-5xl lg:text-6xl xl:text-5xl font-semibold text-[#181a1c] mb-8">
              1. Обрабатываемые данные
            </h2>
            <p>
              1.1. Мы не осуществляем сбор ваших персональных данных с
              использованием Сайта.
              <br />
              1.2. Все данные, собираемые на Сайте, предоставляются и
              принимаются в обезличенной форме (далее – «Обезличенные данные»).
              <br />
              1.3. Обезличенные данные включают следующие сведения, которые не
              позволяют вас идентифицировать:
              <br />
              1.3.1. Информацию, которую вы предоставляете о себе самостоятельно
              с использованием онлайн-форм и программных модулей Сайта,
              включающие номер телефона и/или адрес электронной почты.
              <br />
              1.3.2. Данные, которые передаются в обезличенном виде в
              автоматическом режиме в зависимости от настроек используемого вами
              программного обеспечения.
              <br />
              1.4. Администрация вправе устанавливать требования к составу
              Обезличенных данных Пользователя, которые собираются
              использованием Сайта.
              <br />
              1.5. Если определенная информация не помечена как обязательная, ее
              предоставление или раскрытие осуществляется Пользователем на свое
              усмотрение. Одновременно вы даете информированное согласие на
              доступ неограниченного круга лиц к таким данным. Указанные данные
              становится общедоступными с момента предоставления и/или раскрытия
              в иной форме.
              <br />
              1.6. Администрация не осуществляет проверку достоверности
              предоставляемых данных и наличия у Пользователя необходимого
              согласия на их обработку в соответствии с настоящей Политикой,
              полагая, что Пользователь действует добросовестно, осмотрительно и
              прилагает все необходимые усилия к поддержанию такой информации в
              актуальном состоянии и получению всех необходимых согласий на ее
              использование.
              <br />
              1.7. Вы осознаете и принимаете возможность использования на Сайте
              программного обеспечения третьих лиц, в результате чего такие лица
              могут получать и передавать указанные в п.1.3 данные в
              обезличенном виде. Пример! К указанному программному обеспечению
              третьих лиц относятся системы сбора статистики посещений Google
              Analytics и Яндекс.Метрика.
              <br />
              1.8. Состав и условия сбора обезличенных данных с использованием
              программного обеспечения третьих лиц определяются непосредственно
              их правообладателями и могут включать: данные браузера (тип,
              версия, cookie); данные устройства и место его положения; данные
              операционной системы (тип, версия, разрешение экрана); данные
              запроса (время, источник перехода, IP-адрес).
              <br />
              1.9. Администрация не несет ответственность за порядок
              использования Обезличенных данных Пользователя третьими лицами.
            </p>
          </section>

          <section>
            <h2 className="text-3xl sm:text-4xl md:text-5xl lg:text-6xl xl:text-5xl font-semibold text-[#181a1c] mb-8">
              2. Цели обработки данных
            </h2>
            <p>
              2.1. Администрация использует данные в следующих целях:
              <br />
              2.1.1. Обработка поступающих запросов и связи с Пользователем;
              <br />
              2.1.2. Информационное обслуживание, включая рассылку
              рекламно-информационных материалов;
              <br />
              2.1.3. Проведение маркетинговых, статистических и иных
              исследований;
              <br />
              2.1.4. Таргетирование рекламных материалов на Сайте.
            </p>
          </section>

          <section>
            <h2 className="text-3xl sm:text-4xl md:text-5xl lg:text-6xl xl:text-5xl font-semibold text-[#181a1c] mb-8">
              3. Требования к защите данных
            </h2>
            <p>
              3.1. Администрация осуществляет хранение данных и обеспечивает их
              охрану от несанкционированного доступа и распространения в
              соответствии с внутренними правилами и регламентами.
              <br />
              3.2. В отношении полученных данных сохраняется конфиденциальность,
              за исключением случаев, когда они сделаны Пользователем
              общедоступными, а также когда используемые на Сайте технологии и
              программное обеспечение третьих лиц либо настройки используемого
              Пользователем программного обеспечения предусматривают открытый
              обмен с данными лицами и/или иными участниками и пользователями
              сети Интернет.
              <br />
              3.3. В целях повышения качества работы Администрация вправе
              хранить лог-файлы о действиях, совершенных Пользователем в рамках
              использования Сайта в течение 1 (Одного) года.
            </p>
          </section>

          <section>
            <h2 className="text-3xl sm:text-4xl md:text-5xl lg:text-6xl xl:text-5xl font-semibold text-[#181a1c] mb-8">
              4. Передача данных
            </h2>
            <p>
              4.1. Администрация вправе передать данные третьим лицам в
              следующих случаях:
              <br />
              Пользователь выразил свое согласие на такие действия, включая
              случаи применения Пользователем настроек используемого
              программного обеспечения, не ограничивающих предоставление
              определенной информации;
              <br />
              Передача необходима в рамках использования Пользователем
              функциональных возможностей Сайта;
              <br />
              Передача требуется в соответствии с целями обработки данных;
              <br />
              В связи с передачей Сайта во владение, пользование или
              собственность такого третьего лица;
              <br />
              По запросу суда или иного уполномоченного государственного органа
              в рамках установленной законодательством процедуры;
              <br />
              Для защиты прав и законных интересов Администрации в связи с
              допущенными Пользователем нарушениями.
            </p>
          </section>

          <section>
            <h2 className="text-3xl sm:text-4xl md:text-5xl lg:text-6xl xl:text-5xl font-semibold text-[#181a1c] mb-8">
              5. Изменение Политики конфиденциальности
            </h2>
            <p>
              5.1. Настоящая Политика может быть изменена или прекращена
              Администрацией в одностороннем порядке без предварительного
              уведомления Пользователя. Новая редакция Политики вступает в силу
              с момента ее размещения на Сайте, если иное не предусмотрено новой
              редакцией Политики.
              <br />
              5.2. Действующая редакция Политики находится на Сайте в сети
              Интернет по адресу https://mdzstore.ru/  Действующая редакция
              Политики от марта 2026 г.
            </p>
          </section>
        </div>
      </div>
    </div>
  );
}
